<!-- terraform-plan:dev -->
## terraform-plan (dev)

**Plan: 1 to add, 2 to change, 0 to destroy.**

<details>
<summary>Show full plan output</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_firebase_web_app_config.web will be read during apply
  # (config refers to values not yet known)
 <= data "google_firebase_web_app_config" "web" {
      + api_key             = (known after apply)
      + auth_domain         = (known after apply)
      + database_url        = (known after apply)
      + id                  = (known after apply)
      + location_id         = (known after apply)
      + measurement_id      = (known after apply)
      + messaging_sender_id = (known after apply)
      + project             = "dungeon-studio-genshin-dev"
      + storage_bucket      = (known after apply)
      + web_app_id          = (known after apply)
    }

  # google_firebase_web_app.web will be created
  + resource "google_firebase_web_app" "web" {
      + api_key_id      = (known after apply)
      + app_id          = (known after apply)
      + app_urls        = (known after apply)
      + deletion_policy = "DELETE"
      + display_name    = "Genshin Team Builder (dev)"
      + id              = (known after apply)
      + name            = (known after apply)
      + project         = "dungeon-studio-genshin-dev"
    }

  # google_identity_platform_config.default will be updated in-place
  ~ resource "google_identity_platform_config" "default" {
        id                         = "projects/dungeon-studio-genshin-dev/config"
        name                       = "projects/179636804167/config"
        # (3 unchanged attributes hidden)

      - multi_tenant {
          - allow_tenants           = false -> null
            # (1 unchanged attribute hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # google_identity_platform_default_supported_idp_config.google will be updated in-place
  ~ resource "google_identity_platform_default_supported_idp_config" "google" {
      + client_secret = (sensitive value)
        id            = "projects/dungeon-studio-genshin-dev/defaultSupportedIdpConfigs/google.com"
        name          = "projects/179636804167/defaultSupportedIdpConfigs/google.com"
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  + firebase_web_app_config    = {
      + api_key             = (known after apply)
      + app_id              = (known after apply)
      + auth_domain         = "dungeon-studio-genshin-dev.firebaseapp.com"
      + messaging_sender_id = (known after apply)
      + project_id          = "dungeon-studio-genshin-dev"
      + storage_bucket      = (known after apply)
    }

```
</details>